src/content/publications.md
+++
title = "Publications"
author = ["Siddhartha Kumar"]
date = 2025-07-04
draft = false
+++

## Journals {#journals}

1.  R. Schlegel, **S. Kumar**, E. Rosnes, A. Graell i Amat, "[Codedpaddedfl and
    codedsecagg: Straggler mitigation and secure aggregation in federated
    learning](https://ieeexplore.ieee.org/document/10042414)," IEEE Transactions on Communications, vol. 71, no. 4, Apr. 2023
2.  R. Schlegel, **S. Kumar**, E. Rosnes, A. Graell i Amat, "[Privacy-Preserving
    Coded Mobile Edge Computing for Low-Latency Distributed Inference](https://arxiv.org/abs/2110.03545)," IEEE
    Journal on Selected Areas in Communications (JSAC), vol. 40, no. 3,
    Jan. 2022
3.  H.-Y. Lin, **S. Kumar**, E. Rosnes, A. Graell i Amat, E. Yaakobi,
    "[Multi-Server Weakly-Private Information Retrieval](https://arxiv.org/abs/2007.10174)," IEEE Transactions on
    Information Theory, vol. 68, no. 2, Feb. 2021
4.  H.-Y. Lin, **S. Kumar**, E. Rosnes, A. Graell i Amat, E. Yaakobi, "[The
    Capacity of Single-Server Weakly-Private Information Retrieval](https://arxiv.org/abs/2001.08727)," IEEE
    Journal on Selected Areas in Information Theory, vol. 2, no. 1, Mar.  2021
5.  **S. Kumar**, H.-Y. Lin, E. Rosnes, A. Graell i Amat, “[Achieving maximum
    distance separable private information retrieval capacity with linear
    codes](https://ieeexplore.ieee.org/document/8643953),” IEEE Transactions on Information Theory, vol. 65, no. 8, Aug.
    2019
6.  **S. Kumar**, A. Graell i Amat, E. Rosnes, L. Senigagliesi, “[Private
    Information Retrieval From a Cellular Network With Caching at the Edge](https://ieeexplore.ieee.org/document/8669806),”
    IEEE Transactions on Communications, vol. 67, no. 7, Jul. 2019
7.  **S. Kumar**, A. Graell i Amat, I. Andriyanova, F. Brännström, E. Rosnes,
    “[Code Constructions for Distributed Storage with Low Repair Bandwidth and
    Low Repair Complexity](https://ieeexplore.ieee.org/document/8418386),” IEEE Transactions on Communications, vol. 66,
    no. 12, Dec. 2018
8.  **S. Kumar**, E. Rosnes, A. Graell i Amat, “[Secure Repairable Fountain Codes](https://arxiv.org/abs/1605.08300),”
    IEEE Communications Letters, vol. 20, no. 8, Aug. 2016


## Conferences {#conferences}

1.  **S. Kumar**, M. H. Moghaddam, A. Wolfgang, T. Svensson, “[Path Assignment in
    Mesh Networks at the Edge of Wireless Networks](https://arxiv.org/abs/2411.10228), ” in Proc. IEEE
    International Conference on Communications (ICC) Workshop, Montreal,
    Canada, Jun. 2025
2.  R. Schlegel, **S. Kumar**, E. Rosnes, A. Graell i Amat, “[Straggler-resilient
    secure aggregation for federated learning](https://ieeexplore.ieee.org/document/9909849), ” in Proc. Eur. Signal
    Process. Conf. (EUSIPCO), Belgrade, Serbia, Aug./Sep. 2022 (**Invited paper**)
3.  **S. Kumar**, R. Schlegel, E. Rosnes, A. Graell i Amat, “[Coding for Straggler
    Mitigation in Federated Learning](https://ieeexplore.ieee.org/document/9838986), ” in Proc. IEEE International Conference
    on Communications (ICC), Seoul, South Korea, May 2022
4.  A. Frigård, **S. Kumar**, E. Rosnes, A. Graell i Amat, “[Low-Latency
    Distributed Inference at the Network Edge Using Rateless Codes](https://ieeexplore.ieee.org/document/9562193),” in
    Proc. International Symposium on Wireless Communication Systems (ISWCS),
    Berlin, Germany, Sep. 2021 (**Invited paper**)
5.  R. Schlegel, **S. Kumar**, E. Rosnes, A. Graell i Amat, “[Private Edge
    Computing for Linear Inference Based on Secret Sharing](https://ieeexplore.ieee.org/document/9348077),” in Proc. IEEE
    Global Communications Conference (GLOBECOM), Taipei, Taiwan, Dec. 2020
6.  H.-Y. Lin, **S. Kumar**, E. Rosnes, A. Graell i Amat, E. Yaakobi, “[The
    Capacity of Single-Server Weakly-Private Information Retrieval](https://ieeexplore.ieee.org/document/9174048),” in
    Proc. IEEE International Symposium on Information Theory (ISIT), Los
    Angeles, CA, Jun. 2020
7.  H.-Y. Lin, **S. Kumar**, E. Rosnes, A. Graell i Amat, “[Improved Private
    Information Retrieval for Coded Storage From Code Decomposition](https://ieeexplore.ieee.org/document/8989190),” in
    Proc. IEEE Information Theory Workshop (ITW), Visby, Gotland, Sweden,
    Aug. 2019 (**Invited paper**)
8.  **S. Kumar**, A. Graell i Amat, E. Rosnes, “[Private Information Retrieval in
    Wireless Coded Caching](https://ieeexplore.ieee.org/document/8815548),” in Proc. IEEE International Workshop on Signal
    Processing Advances in Wireless Communications (SPAWC), Cannes, France,
    Jul. 2019 (**Invited paper**)
9.  H.-Y. Lin, **S. Kumar**, E. Rosnes, A. Graell i Amat, E. Yaakobi,
    “[Weakly-Private Information Retrieval](https://ieeexplore.ieee.org/document/8849444),” in Proc. IEEE International
    Symposium on Information Theory (ISIT), Paris, France, Jul. 2019
10. **S. Kumar**, H.-Y. Lin, E. Rosnes, A. Graell i Amat, “[Local Reconstruction
    Codes: A Class of MDS-PIR Capacity-Achieving Codes](https://ieeexplore.ieee.org/document/8613503),” in Proc. IEEE
    Information Theory Workshop (ITW), Guangzhou, China, Nov. 2018
11. H.-Y. Lin, **S. Kumar**, E. Rosnes, A. Graell i Amat, “[Asymmetry helps:
    Improved private information retrieval protocols for distributed
    storage](https://ieeexplore.ieee.org/document/8613500),” in Proc. IEEE Information Theory Workshop (ITW), Guangzhou,
    China, Nov. 2018
12. H.-Y. Lin, **S. Kumar**, E. Rosnes, A. Graell i Amat, “[An MDS-PIR
    Capacity-Achieving Protocol for Distributed Storage Using Non-MDS Linear
    Codes](https://ieeexplore.ieee.org/document/8437804),” in Proc. IEEE International Symposium on Information Theory
    (ISIT), Vail, CO, Jun. 2018
13. **S. Kumar**, E. Rosnes, A. Graell i Amat, “[Private Information Retrieval in
    Distributed Storage Systems Using an Arbitrary Linear Code](https://ieeexplore.ieee.org/document/8006763),” in
    Proc. IEEE International Symposium on Information Theory (ISIT), Aachen,
    Germany, Jun. 2017
14. **S. Kumar**, A. Graell i Amat, I. Andriyanova, F. Brännström, “[A Family of
    Erasure Correcting Codes with Low Repair Bandwidth and Low Repair
    Complexity](https://ieeexplore.ieee.org/document/7417790),” in Proc. IEEE Global Communications Conference (GLOBECOM),
    San Diego, CA, Dec. 2015


## Theses {#theses}

1.  **S. Kumar**, “[Privacy, Security, and Repair in Distributed Storage Systems](https://bora.uib.no/bora-xmlui/handle/1956/18691),”
    (Doctoral Thesis), University of Bergen, Aug. 2018
2.  **S. Kumar**, “[Repair Efficient Erasure Correcting Codes for Distributed
    Storage Systems](https://odr.chalmers.se/items/c298f0f4-ff44-463f-9107-377d8c26f6d6),” (Master Thesis), Chalmers University of Technology,
    Jun. 2015
3.  **S. Kumar**, “[Speaker Emotion Recognition for Human Computer Interaction](https://www.amrita.edu/news/emotion-recognition-in-human-computer-interaction/),”
    (Bachelor Thesis), Amrita Vishwavidyapeetham, May 2013

<br />
